# <center>________________________________________________________________</center>

# <center>EXAMPLES OF DML AND DDL COMMANDS</center>

# <center>________________________________________________________________</center>

## Libraries
***

In [ ]:
#!pip install sqlalchemy
#!pip install sqlite3
#!pip install ipython-sql

In [1]:
import sqlite3

## Creating and Connecting to a Database
***

In [2]:
%load_ext sql

In [3]:
con = sqlite3.connect("mydatabase.db")
cur = con.cursor()

In [4]:
%sql sqlite:///mydatabase.db

In [5]:
#Check if there is already a table called "PLAYERS"

%sql DROP TABLE IF EXISTS PLAYERS;

 * sqlite:///mydatabase.db
Done.

[]

# DDL STATEMENTS
***

## CREATE
***

In [6]:
%%sql

CREATE TABLE PLAYERS
    (ID INTEGER PRIMARY KEY NOT NULL,
     FNAME INTEGER,
     LASTNAME VARCHAR(20),
     CITY VARCHAR(20),
     CCODE CHAR(2));

 * sqlite:///mydatabase.db
Done.

[]

In [7]:
# Metadata

%sql SELECT name,type,length(type) FROM PRAGMA_TABLE_INFO('PLAYERS');

 * sqlite:///mydatabase.db
Done.

[('ID', 'INTEGER', 7),
 ('FNAME', 'INTEGER', 7),
 ('LASTNAME', 'VARCHAR(20)', 11),
 ('CITY', 'VARCHAR(20)', 11),
 ('CCODE', 'CHAR(2)', 7)]

## ALTER
***

### Add a Column

In [8]:
%%sql

ALTER TABLE PLAYERS
    ADD COLUMN SERIAL_NUMBER BIGINT;

 * sqlite:///mydatabase.db
Done.

[]

In [9]:
%sql SELECT name,type,length(type) FROM PRAGMA_TABLE_INFO('PLAYERS');

 * sqlite:///mydatabase.db
Done.

[('ID', 'INTEGER', 7),
 ('FNAME', 'INTEGER', 7),
 ('LASTNAME', 'VARCHAR(20)', 11),
 ('CITY', 'VARCHAR(20)', 11),
 ('CCODE', 'CHAR(2)', 7),
 ('SERIAL_NUMBER', 'BIGINT', 6)]

### Drop a Column

In [10]:
%%sql

ALTER TABLE PLAYERS
    DROP COLUMN SERIAL_NUMBER;

 * sqlite:///mydatabase.db
Done.

[]

In [11]:
%sql SELECT name,type,length(type) FROM PRAGMA_TABLE_INFO('PLAYERS');

 * sqlite:///mydatabase.db
Done.

[('ID', 'INTEGER', 7),
 ('FNAME', 'INTEGER', 7),
 ('LASTNAME', 'VARCHAR(20)', 11),
 ('CITY', 'VARCHAR(20)', 11),
 ('CCODE', 'CHAR(2)', 7)]

### Change the Data Type or Name of a Column

Normally we would execute the following cells but in SQLite the ALTER TABLE statement has limited functionality compared to other database management systems. SQLite doesn't provide a direct command to change the data type OR name of a column. So next statements won't be executed:

%%sql

ALTER TABLE PLAYERS
    ALTER COLUMN FNAME SET TYPE VARCHAR(20);

%%sql

ALTER TABLE PLAYERS
    RENAME COLUMN LASTNAME TO LNAME;

As instead, following codes will be executed as an alternative to change the data type and name:

In [12]:
%%sql

CREATE TABLE TEMP_PLAYERS (
    ID INTEGER PRIMARY KEY,
    FNAME VARCHAR(20),
    LASTNAME VARCHAR(20),
    CITY VARCHAR(20),
    CCODE CHAR(2)
    );

INSERT INTO TEMP_PLAYERS (ID, FNAME, LASTNAME, CITY, CCODE)
SELECT ID, FNAME, LASTNAME, CITY, CCODE FROM PLAYERS;

DROP TABLE PLAYERS;

ALTER TABLE TEMP_PLAYERS RENAME TO PLAYERS;

 * sqlite:///mydatabase.db
Done.
0 rows affected.
Done.
Done.

[]

In [13]:
%%sql

CREATE TABLE TEMP_PLAYERS (
    ID INTEGER PRIMARY KEY,
    FNAME VARCHAR(20),
    LNAME VARCHAR(20),
    CITY VARCHAR(20),
    CCODE CHAR(2)
    );

INSERT INTO TEMP_PLAYERS (ID, FNAME, LNAME, CITY, CCODE)
SELECT ID, FNAME, LASTNAME, CITY, CCODE FROM PLAYERS;

DROP TABLE PLAYERS;

ALTER TABLE TEMP_PLAYERS RENAME TO PLAYERS;

 * sqlite:///mydatabase.db
Done.
0 rows affected.
Done.
Done.

[]

In [14]:
%sql SELECT name,type,length(type) FROM PRAGMA_TABLE_INFO('PLAYERS');

 * sqlite:///mydatabase.db
Done.

[('ID', 'INTEGER', 7),
 ('FNAME', 'VARCHAR(20)', 11),
 ('LNAME', 'VARCHAR(20)', 11),
 ('CITY', 'VARCHAR(20)', 11),
 ('CCODE', 'CHAR(2)', 7)]

### Rename a Table

In [15]:
%%sql

ALTER TABLE PLAYERS RENAME TO NEW_PLAYERS;

 * sqlite:///mydatabase.db
Done.

[]

In [16]:
# The database system catalog

%sql SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///mydatabase.db
Done.

[('NEW_PLAYERS',)]

## TRUNCATE
***

Normally we would execute the following cell to clean our table but in SQLite the TRUNCATE TABLE statement has limited functionality compared to other database management systems. SQLite doesn't provide a direct command to empty a table. So next statement won't work:

%%sql

TRUNCATE TABLE NEW_PLAYERS
    IMMEDIATE;

As instead, following code would be executed as an alternative, if there was any data in the table:

In [ ]:
%%sql

DELETE FROM NEW_PLAYERS;
VACUUM;

## DROP
***

In [17]:
%%sql

DROP TABLE NEW_PLAYERS;

 * sqlite:///mydatabase.db
Done.

[]

In [18]:
%sql SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///mydatabase.db
Done.

[]

# DML STATEMENTS
***

First we will create an empty table:

In [19]:
%%sql

DROP TABLE IF EXISTS PLAYERS;

CREATE TABLE PLAYERS
    (ID INTEGER PRIMARY KEY NOT NULL,
     FNAME VARCHAR(20),
     LNAME VARCHAR(20),
     CITY VARCHAR(20),
     CCODE CHAR(2));

 * sqlite:///mydatabase.db
Done.
Done.

[]

In [20]:
%sql SELECT name,type,length(type) FROM PRAGMA_TABLE_INFO('PLAYERS');

 * sqlite:///mydatabase.db
Done.

[('ID', 'INTEGER', 7),
 ('FNAME', 'VARCHAR(20)', 11),
 ('LNAME', 'VARCHAR(20)', 11),
 ('CITY', 'VARCHAR(20)', 11),
 ('CCODE', 'CHAR(2)', 7)]

# INSERT
***

### Single Row

In [21]:
%%sql

INSERT INTO PLAYERS
    VALUES (1, 'Sam', 'Fisher', 'Montreal', 'CA');

 * sqlite:///mydatabase.db
1 rows affected.

[]

### Multiple Rows

In [22]:
%%sql

INSERT INTO PLAYERS
    VALUES (2, 'Aphex', 'Twin', 'London', 'UK'),
    (3, 'Marshall', 'Matters', 'Detroit', 'US'),
    (4, 'Marie', 'Curie', 'Warsaw', 'PL'),
    (5, 'Tony', 'Parker', 'Paris', 'FR');

 * sqlite:///mydatabase.db
4 rows affected.

[]

# SELECT
***

In [23]:
%sql SELECT * FROM PLAYERS;

 * sqlite:///mydatabase.db
Done.

[(1, 'Sam', 'Fisher', 'Montreal', 'CA'),
 (2, 'Aphex', 'Twin', 'London', 'UK'),
 (3, 'Marshall', 'Matters', 'Detroit', 'US'),
 (4, 'Marie', 'Curie', 'Warsaw', 'PL'),
 (5, 'Tony', 'Parker', 'Paris', 'FR')]

# UPDATE
***

In [24]:
%%sql

UPDATE PLAYERS SET CITY='Toronto'
    WHERE FNAME='Sam';

 * sqlite:///mydatabase.db
1 rows affected.

[]

In [25]:
%%sql

SELECT * FROM PLAYERS
    WHERE FNAME='Sam';

 * sqlite:///mydatabase.db
Done.

[(1, 'Sam', 'Fisher', 'Toronto', 'CA')]

# DELETE
***

In [26]:
%%sql

DELETE FROM PLAYERS
    WHERE ID IN (1,2);

 * sqlite:///mydatabase.db
2 rows affected.

[]

In [27]:
%sql SELECT * FROM PLAYERS;

 * sqlite:///mydatabase.db
Done.

[(3, 'Marshall', 'Matters', 'Detroit', 'US'),
 (4, 'Marie', 'Curie', 'Warsaw', 'PL'),
 (5, 'Tony', 'Parker', 'Paris', 'FR')]

# Close the Connection
***

In [28]:
con.close()

# <center>________________________________________________________________</center>